-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1
-- 生成日期： 2024-07-09 05:12:14
-- 服务器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `playmanage`
--

-- --------------------------------------------------------

--
-- 表的结构 `admins`
--

CREATE TABLE `admins` (
  `id` int(10) NOT NULL,
  `account` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 转存表中的数据 `admins`
--

INSERT INTO `admins` (`id`, `account`, `password`) VALUES
(1, 'wangxiaoming', '123456'),
(2, 'lichao', '123456'),
(8, 'zlf1', '123456'),
(9, 'xxxx', '123456');

-- --------------------------------------------------------

--
-- 表的结构 `albums`
--

CREATE TABLE `albums` (
  `id` int(10) NOT NULL,
  `name` varchar(20) NOT NULL,
  `introduce` varchar(500) NOT NULL,
  `bysonger` varchar(20) NOT NULL,
  `pic` varchar(20) NOT NULL,
  `time` varchar(20) NOT NULL,
  `inmusic` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 转存表中的数据 `albums`
--

INSERT INTO `albums` (`id`, `name`, `introduce`, `bysonger`, `pic`, `time`, `inmusic`) VALUES
(11, '<平凡的一天>', '冷暖人间 为平凡发声 赤子之心 无限创作力 毛不易 2018 个人创作作品辑 平凡的一天  创作才子 毛不易 X 制作总监 李健 现实主义和浪漫主义的历史性碰撞', '毛不易', '1715395357419.jpg', '2018-07-03', '消愁'),
(12, '<绅士>', '当那背影离去 仿佛也可以 脱下礼帽 深情致敬 全唱作把『心』交出来 最认真的 薛之谦 再次穿越感官最后防线突破抑制 尽情泪流 2015全唱作 NO.7概念EP『绅士』6/5 海蝶音乐诚意发行 从带上面具的《丑八怪》到摘下礼帽的《绅士》 这，都是薛之谦 这，都是用优雅到极限来诠释伤悲的爱情寓言 3首全唱作谦谦情歌 令每一个爱过的人都痛到慰藉 让每一个爱着的人也为之黯然 出道10年，2015年正式签约海蝶音乐，首次担当制作人的薛之谦，包揽了这张概念EP的所有词曲，仅3首唱作曲目，但是100%的薛之谦。从上一张专辑到《绅士》经历了19个月，往返北京、上海、台北……好好做“音乐”是薛之谦最认真的梦想，不遗余力，甚至有些强迫症。 从《认真的雪》到《你还要我怎样》，薛之谦的情歌，听着总是让人不由的纠结和悲伤。“相对于作曲，我更加喜欢填词。”这一次作为EP总制作人的他，是这样评价自己的。 “在爱情面前，我不是一位《演员》，但愿成为一名《绅士》。” 翻开歌词本，带上耳机，听完这三首歌，你会发现，这里住着一位“心里下着雨”的薛之谦。', '薛之谦', '1715395803569.jpg', '2015-06-05', '演员,绅士'),
(13, '<因你而在>', '「这张专辑属于你们，没有你们就没有我。 我，林俊杰，因你而在。」 10年前写下的 10年后成为故事 JJ林俊杰 因你而在 为你而唱 唱出那些 不曾说过的故事 『 我发现，生活中我们永远都在做一件同样的事情 - 寻回。寻回童年，寻回当初的无忧无虑。寻回感动，因为曾经一定有人让我们奋不顾身去相信爱情。寻回勇气，因为也许某些错过的机会现在回不去了。寻回梦想，所谓「once bitten twice shy」；碰壁时，有些人可能会越挫越勇，但挫败多了，难免还是会气馁。寻回单纯的 快乐。或许我是个念旧的人，我觉得怀念，不是因为以前比较好， 而是可以让自己懂得更珍惜现在，甚至把自己未来的路铺得更好。 我们的过去，是让我们看到现在的价值的证据。', '林俊杰', '1715436051210.jpg', '2013-03-13', '裂缝中的阳光'),
(14, '<第二天堂>', '史上最屌 3D动画 在线游戏 全亚洲百万会员见证的 天堂II  一直以来以丰盛不断的创作能源，加上特殊的嗓音，使得去年2003年发行第一张个人大碟『乐行者』，虽遇上SARS，大家人心惶惶，但却在台湾开出销售红盘……尤其内地的近百万张的量，更让大家对这个当时才22岁，新加坡能写能唱的新生代歌手，多了更多的惊喜与期待！而现在，终于，你可以听见并且看见：一年来他累积的音乐能量及蜕变成大男生的全记录！  就在2004全新大碟『第二天堂』---HAVEN', '毛不易', '1715434946477.jpg', '2004-06-04', '江南'),
(15, '<意外>', '人生本就是一场意外，纵横交错的际遇遍布着生活的每个角落。 每天都在遇见不同的人，经历不同的风景，行走不同的轨迹。 面对未知的生活，我们一直都在寻寻觅觅中快步疾行，很多人擦身而过，很多事过眼烟云。抓不住，放不下，在患得患失中我们不停地迷失、遗忘、错过。 你惧怕意外吗？还是害怕无法预料的将来？ 我们常常否定现状，假设未来。但生活依旧不断前行。 遇见你是一场意外，但是如果没有遇见你，我又将去往何方？ 一个人去静静流浪，亦或颠覆过往，来一回彻底的刺激疯狂。 沿途风景匆匆倒退，当一切终归尘埃落定， 你是否还会站在原处，陪我一起看那最初的风景。', '毛不易', '1715435058409.jpg', '2013-11-11', '绅士'),
(16, '<认了吧>', '陈奕迅Eason筹备多时的最新国语专辑《认了吧》将于4月24日在亚洲各地同步推出。 这次用作为专辑名称，Eason说这是与制作过程有关。 「做上一张广东大碟《What\'s Going On》时我本想把它做得统一一些，但后来因时间紧迫而愈做愈乱，就连自己也不知自己想要甚么，所以大碟名便为《What\'s Going On》。」 「到了这次这张国语专辑，构思是把《What\'s Going On》内的歌曲重新填上歌词及编曲，但内容及感觉都要和原先的歌曲有互相呼应之效，不过最后也因为时间关系而未能全部配合到，所以唯有认命吧！专辑名称《认了吧》便是这样而来。」', '陈奕迅', '1715671429703.jpg', '2007-04-24', '红玫瑰');

-- --------------------------------------------------------

--
-- 表的结构 `musics`
--

CREATE TABLE `musics` (
  `id` int(10) NOT NULL,
  `pic` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `location` varchar(200) NOT NULL,
  `lyrc` varchar(2000) NOT NULL,
  `bysonger` varchar(20) NOT NULL,
  `bydoc` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 转存表中的数据 `musics`
--

INSERT INTO `musics` (`id`, `pic`, `name`, `location`, `lyrc`, `bysonger`, `bydoc`) VALUES
(13, '1715668897229.jpg', '消愁', '1715668904029.mp3', '[00:02.196],\n[00:31.626]当你走进这欢乐场,\n[00:35.809]背上所有的梦与想,\n[00:40.096]各色的脸上各色的妆,\n[00:44.392]没人记得你的模样,\n[00:47.926],\n[00:48.679]三巡酒过你在角落,\n[00:52.947]固执的唱着苦涩的歌,\n[00:57.198]听它在喧嚣里被淹没,\n[01:01.143]你拿起酒杯对自己说,\n[01:05.570],\n[01:07.825]一杯敬朝阳 一杯敬月光,\n[01:11.847]唤醒我的向往 温柔了寒窗,\n[01:15.599]于是可以不回头地逆风飞翔,\n[01:20.421]不怕心头有雨 眼底有霜,\n[01:23.992],\n[01:24.774]一杯敬故乡 一杯敬远方,\n[01:28.977]守着我的善良 催着我成长,\n[01:32.813]所以南北的路从此不再漫长,\n[01:37.599]灵魂不再无处安放,\n[01:44.062],\n[02:03.441]躁动不安的座上客,\n[02:07.561]自以为是地表演着,\n[02:12.099]伪装着 舞蹈着 疲惫着,\n[02:15.645]你拿起酒杯对自己说,\n[02:20.495]一杯敬朝阳 一杯敬月光,\n[02:24.753]唤醒我的向往 温柔了寒窗,\n[02:28.531]于是可以不回头地逆风飞翔,\n[02:33.196]不怕心头有雨 眼底有霜,\n[02:36.900],\n[02:37.500]一杯敬故乡 一杯敬远方,\n[02:41.855]守着我的善良 催着我成长,\n[02:45.616]所以南北的路从此不再漫长,\n[02:50.448]灵魂不再无处安放,\n[02:55.697],\n[03:01.235]一杯敬明天 一杯敬过往,\n[03:05.448]支撑我的身体 厚重了肩膀,\n[03:09.182]虽然从不相信所谓山高水长,\n[03:14.006]人生苦短何必念念不忘,\n[03:17.951],\n[03:18.366]一杯敬自由 一杯敬死亡,\n[03:22.599]宽恕我的平凡 驱散了迷惘,\n[03:26.365]好吧天亮之后总是潦草离场,\n[03:31.133]清醒的人最荒唐,\n[03:37.806]清醒的人最荒唐,\n[03:47.998],\n', '毛不易', '<平凡的一天>'),
(14, '1715666515073.jpg', '像我这样的人', '1715666522952.mp3', '[00:09.840],\n[00:15.000]像我这样优秀的人,\n[00:18.770]本该灿烂过一生,\n[00:22.620]怎么二十多年到头来,\n[00:26.700]还在人海里浮沉,\n[00:30.240],\n[00:30.350]像我这样聪明的人,\n[00:34.500]早就告别了单纯,\n[00:38.380]怎么还是用了一段情,\n[00:42.360]去换一身伤痕,\n[00:44.680],\n[00:46.150]像我这样迷茫的人,\n[00:49.840]像我这样寻找的人,\n[00:53.800]像我这样碌碌无为的人,\n[00:57.590]你还见过多少人,\n[01:06.910],\n[01:18.640]像我这样庸俗的人,\n[01:22.830]从不喜欢装深沉,\n[01:26.540]怎么偶尔听到老歌时,\n[01:30.620]忽然也晃了神,\n[01:34.380]像我这样懦弱的人,\n[01:38.240]凡事都要留几分,\n[01:42.200]怎么曾经也会为了谁,\n[01:45.950]想过奋不顾身,\n[01:47.680],\n[01:49.870]像我这样迷茫的人,\n[01:53.770]像我这样寻找的人,\n[01:57.490]像我这样碌碌无为的人,\n[02:01.450]你还见过多少人,\n[02:04.690],\n[02:05.460]像我这样孤单的人,\n[02:09.200]像我这样傻的人,\n[02:13.260]像我这样不甘平凡的人,\n[02:16.990]世界上有多少人,\n[02:21.580],\n[02:26.760]像我这样迷茫的人,\n[02:30.510]像我这样寻找的人,\n[02:34.370]像我这样碌碌无为的人,\n[02:38.230]你还见过多少人,\n[02:41.240],\n[02:42.000]像我这样孤单的人,\n[02:46.100]像我这样傻的人,\n[02:49.970]像我这样不甘平凡的人,\n[02:53.650]世界上有多少人,\n[02:56.630],\n[02:59.630]像我这样莫名其妙的人,\n[03:05.430]会不会有人心疼,\n[03:14.050],\n\n[03:25.940],', '毛不易', '<平凡的一天>'),
(15, '1715671842055.jpg', '演员', '1715671848051.mp3', '[00:05.409],\n[00:21.056]简单点,\n[00:24.967]说话的方式简单点,\n[00:30.439]递进的情绪请省略,\n[00:33.369]你又不是个演员,\n[00:36.016]别设计那些情节,\n[00:41.795]没意见,\n[00:45.905]我只想看看你怎么圆,\n[00:51.415]你难过的太表面,\n[00:54.338]像没天赋的演员,\n[00:56.937]观众一眼能看见,\n[01:02.295]该配合你演出的我演视而不见,\n[01:07.395]在逼一个最爱你的人即兴表演,\n[01:12.584]什么时候我们开始收起了底线,\n[01:17.824]顺应时代的改变看那些拙劣的表演,\n[01:23.069]可你曾经那么爱我干嘛演出细节,\n[01:28.423]我该变成什么样子才能延缓厌倦,\n[01:33.707]原来当爱放下防备后的这些那些,\n[01:39.105]才是考验,\n[01:44.899]没意见,\n[01:48.762]你想怎样我都随便,\n[01:54.574]你演技也有限,\n[01:57.210]又不用说感言,\n[01:59.776]分开就平淡些,\n[02:05.003]该配合你演出的我演视而不见,\n[02:10.281]别逼一个最爱你的人即兴表演,\n[02:15.577]什么时候我们开始没有了底线,\n[02:20.685]顺着别人的谎言被动就不显得可怜,\n[02:26.002]可你曾经那么爱我干嘛演出细节,\n[02:31.284]我该变成什么样子才能配合出演,\n[02:36.548]原来当爱放下防备后的这些那些,\n[02:41.810]都有个期限,\n[02:47.806]其实台下的观众就我一个,\n[02:52.934]其实我也看出你有点不舍,\n[02:57.957]场景也习惯我们来回拉扯,\n[03:02.763]还计较着什么,\n[03:08.619]其实说分不开的也不见得,\n[03:13.691]其实感情最怕的就是拖着,\n[03:19.010]越演到重场戏越哭不出了,\n[03:24.025]是否还值得,\n[03:28.865]该配合你演出的我尽力在表演,\n[03:34.138]像情感节目里的嘉宾任人挑选,\n[03:39.404]如果还能看出我有爱你的那面,\n[03:44.602]请剪掉那些情节让我看上去体面,\n[03:49.795]可你曾经那么爱我干嘛演出细节,\n[03:55.033]不在意的样子是我最后的表演,\n[04:00.917]是因为爱你我才选择表演,\n[04:05.957]这种成全,\n[04:10.323],\n', '薛之谦', '<绅士>'),
(16, '1715668568311.jpg', '绅士', '1715668634633.mp3', '[00:18.980]好久没见了什么角色呢,\n[00:23.220]细心装扮着,\n[00:25.010]白色衬衫的袖扣是你送的,\n[00:31.680]尽量表现着像不在意的,\n[00:35.870]频繁暴露了自欺欺人者,\n[00:41.250]越掩饰越深刻,\n[00:44.290]你说我说听说,\n[00:47.570]忍着言不由衷的段落,\n[00:50.970],\n[00:51.860]我反正决定自己难过,\n[00:58.430],\n[01:01.200]我想摸你的头发,\n[01:03.400]只是简单的试探啊,\n[01:06.740],\n[01:09.490]我想给你个拥抱,\n[01:11.830]像以前一样可以吗,\n[01:16.620]你退半步的动作认真的吗,\n[01:21.280]小小的动作伤害还那么大,\n[01:25.560]我只能扮演个绅士,\n[01:28.750]才能和你说说话,\n[01:32.840],\n[01:34.540]我能送你回家吗,\n[01:37.150]可能外面要下雨啦,\n[01:40.340],\n[01:43.220]我能给你个拥抱,\n[01:45.450]像朋友一样可以吗,\n[01:48.820],\n[01:50.630]我忍不住从背后抱了一下,\n[01:55.010]尺度掌握在不能说想你啊,\n[01:58.990]你就当刚认识的绅士,\n[02:02.580]闹了个笑话吧,\n[02:07.650],\n[02:21.060]尽量表现着善解人意的,\n[02:25.320]频繁暴露了不欲人知的,\n[02:30.880]越掩饰越深刻,\n[02:33.830]想说听说别说,\n[02:37.000]忍着言不由衷的段落,\n[02:41.130]我反正注定留在角落,\n[02:48.030],\n[02:50.270]我想摸你的头发,\n[02:52.930]只是简单的试探啊,\n[02:57.690],\n[02:58.700]我想给你个拥抱,\n[03:01.320]像以前一样可以吗,\n[03:05.020],\n[03:06.440]你退半步的动作认真的吗,\n[03:10.860]小小的动作伤害还那么大,\n[03:14.980]我只能扮演个绅士,\n[03:18.270]才能和你说说话,\n[03:22.140],\n[03:24.110]我能送你回家吗,\n[03:26.650]可能外面要下雨啦,\n[03:31.970]我能给你个拥抱,\n[03:35.020]像朋友一样可以吗,\n[03:38.640],\n[03:40.090]我忍不住从背后抱了一下,\n[03:44.570]尺度掌握在不能说想你啊,\n[03:48.480]你就当刚认识的绅士,\n[03:52.130]闹了个笑话吧,\n[03:56.320],\n[03:57.980]你能给我只左手,\n[04:00.230]牵你到马路那头吗,\n[04:03.880],\n[04:05.790]我会像以前一样,\n[04:08.700]看着来往的车子啊,\n[04:13.890]我们的距离在眉间皱了下,\n[04:18.430]迅速还原成路人的样子啊,\n[04:22.680]越有礼貌我越害怕,\n[04:25.760]绅士要放得下,', '薛之谦', '<绅士>'),
(17, '1715670109614.jpg', '背对背拥抱', '1715670113444.mp3', '[00:02.18]背对背拥抱,\n[00:04.83]作词：林怡凤 作曲：林俊杰,\n[00:06.79]演唱：林俊杰,\n[00:08.47],\n[00:15.23]话总说不清楚 该怎么明了,\n[00:22.70]一字一句像圈套,\n[00:29.90]旧帐总翻不完 谁无理取闹,\n[00:36.64]你的双手甩开刚好的微妙,\n[00:42.21]然后战火再燃烧,\n[00:46.49],\n[00:48.74]我们背对背拥抱,\n[00:52.40]滥用沉默在咆哮,\n[00:56.06]爱情来不及变老,\n[00:59.07]葬送在烽火的玩笑,\n[01:02.86],\n[01:03.51]我们背对背拥抱,\n[01:07.15]真话兜着圈子乱乱绕,\n[01:11.06]只是想让我知道,\n[01:14.94]只是想让你知道 爱的警告,\n[01:21.00],\n[01:23.74]话总说不清楚 该怎么明了,\n[01:30.68]一字一句像圈套,\n[01:38.22]旧帐总翻不完 谁无理取闹,\n[01:45.12]你的双手甩开刚好的微妙,\n[01:50.61]然后战火再燃烧,\n[01:54.53],\n[01:55.24]我们背对背拥抱,\n[01:58.82]滥用沉默在咆哮,\n[02:02.56]爱情来不及变老,\n[02:05.53]葬送在烽火的玩笑,\n[02:09.00],\n[02:10.71]我们背对背拥抱,\n[02:13.65]真话兜着圈子乱乱绕,\n[02:17.46]只是想让我知道,\n[02:21.23]只是想让你知道 爱的警告,\n[02:28.13],\n[02:29.35]我不要一直到 形同陌路变成自找,\n[02:36.47]既然可以拥抱  就不要轻易放掉,\n[02:43.67],\n[02:45.31]我们背对背拥抱,\n[02:48.74]滥用沉默在咆哮,\n[02:52.29]爱情来不及变老,\n[02:55.35]葬送在烽火的玩笑,\n[02:59.20],\n[02:59.62]我们背对背拥抱,\n[03:03.43]真话兜着圈子乱乱绕,\n[03:07.55]只是想让我知道,\n[03:11.21]只是想让你知道 这警告,\n[03:18.56]只是想让我知道,\n[03:22.14]只是想让你知道 爱的警告,\n[03:31.21],', '林俊杰', '<因你而在>'),
(18, '1715669344624.jpg', '江南', '1715669352262.mp3', '[0035.80]风到这里就是粘，\n[0039.16]粘住过客的思念，\n[0043.67]雨到了这里缠成线，\n[0047.17]缠着我们流连人世间，\n[0051.83]你在身边就是缘，\n[0055.26]缘分写在三生石上面，\n[0059.80]爱有万分之一甜，\n[0103.26]宁愿我就葬在这一天，\n[0107.89]圈圈圆圆圈圈，\n[0111.14]天天年年天天 的我，\n[0113.88]深深看你的脸，\n[0116.29]生气的温柔  埋怨的温柔 的脸，\n[0123.46]，\n[0124.53]不懂爱恨情愁煎熬的我们，\n[0128.02]都以为相爱就像风云的善变，，\n[0132.11]相信爱一天  抵过永远，\n[0136.46]在这一刹那冻结了时间，\n[0140.26]不懂怎么表现温柔的我们，\n[0144.08]还以为殉情只是古老的传言，\n[0147.95]离愁能有多痛  痛有多浓，\n[0152.57]当梦被埋在江南烟雨中，\n[0155.81]心碎了才懂，\n[0159.16]，\n[0221.38]圈圈圆圆圈圈，\n[0223.12]天天年年天天 的我，\n[0225.87]深深看你的脸，\n[0228.25]生气的温柔  埋怨的温柔 的脸，\n[0235.51]，\n[0236.37]不懂爱恨情愁煎熬的我们，\n[0240.08]都以为相爱就像风云的善变，\n[0244.07]相信爱一天  抵过永远，\n[0248.60]在这一刹那冻结了时间，\n[0252.24]不懂怎么表现温柔的我们，\n[0256.13]还以为殉情只是古老的传言，\n[0300.06]离愁能有多痛  痛有多浓，\n[0304.53]当梦被埋在江南烟雨中，\n[0307.83]心碎了才懂，\n[0311.28]，\n[0320.38]相信爱一天  抵过永远，\n[0324.61]在这一刹那冻结了时间，\n[0328.24]不懂怎么表现温柔的我们，\n[0332.06]还以为殉情只是古老的传言，\n[0336.02]离愁能有多痛  痛有多浓，\n[0340.55]当梦被埋在江南烟雨中，\n[0345.93]心碎了才懂，\n[0349.37]，\n', '林俊杰', '<第二天堂>'),
(19, '1715670477689.jpg', '裂缝中的阳光', '1715670485604.mp3', '[00:20.87]有多少创伤卡在咽喉,\n[00:26.43]有多少眼泪滴湿枕头,\n[00:32.10]有多少你觉得不能够,\n[00:36.31]被懂的痛只能沉默,\n[00:43.34]有多少夜晚没有尽头,\n[00:48.88]有多少的寂寞无人诉说,\n[00:54.70]有多少次的梦还没做,\n[01:01.08]已成空,\n[01:05.70]等到黑夜翻面之后,\n[01:08.91]会是新的白昼,\n[01:11.66]等到海啸退去之后,\n[01:14.43]只是潮起潮落,\n[01:18.00]别到最后你才发觉,\n[01:21.43]心里头的野兽,\n[01:24.27]还没到最终就已经罢休,\n[01:28.64]心脏没有那么脆弱,\n[01:31.43]总还会有执着,\n[01:34.25]人生不会只有收获,\n[01:37.02]总难免有伤口,\n[01:40.50]不要害怕生命中,\n[01:44.13]不完美的角落,\n[01:46.87]阳光在每个裂缝中散落,\n[02:16.49]就算一切重来又怎样,\n[02:22.27]让你的心在我心上跳动,\n[02:27.83]每个逐渐暗下来的夜,\n[02:33.52]一起走过,\n[02:39.17]等到黑夜翻面之后,\n[02:42.04]会是新的白昼,\n[02:44.70]等到海啸退去之后,\n[02:47.68]只是潮起潮落,\n[02:51.16]别到最后你才发觉,\n[02:54.63]心里头的野兽,\n[02:57.56]还没到最终就已经罢休,\n[03:01.74]心脏没有那么脆弱,\n[03:04.66]总还会有执着,\n[03:07.43]人生不会只有收获,\n[03:10.28]总难免有伤口,\n[03:13.73]不要害怕生命中,\n[03:17.23]不完美的角落,\n[03:20.15]阳光在每个裂缝中散落,\n[03:27.94]不如就勇敢打破生命中的裂缝,\n[03:34.26]阳光就逐渐洒满了其中,\n\n[03:43.605]配唱制作 : 林俊杰,\n[03:43.763]制作协力 : 周信廷,\n[03:43.907]键盘 : 林俊杰,\n[03:44.021]吉他 : Jamie Wilson,\n[03:44.190]和声编写 : 林俊杰,\n[03:44.339]和声 : 林俊杰,\n[03:44.471]录音室 : The Link（Taipei）/JFJ Base Camp（Taipei）,\n[03:44.604]录音师 : Dr.Moon/林俊杰,\n[03:44.773]混音室 : Blue Moon Studio（California）,\n[03:44.908]混音师 : Joe Vannelli/Joe Primeau with 林俊杰,\n[03:44.998]OP : 哈里坤的狂欢有限公司,\n[03:45.147]SP : Universal Music Publishing Limited Taiwan,\n[03:45.280]OP : JFJ Productions Corp.,\n[03:45.418]SP : Universal Music Publishing Ltd Taiwan.,\n', '林俊杰', '<因你而在>'),
(24, '1715671576975.jpg', '红玫瑰', '1715671586906.mp3', '\n[00:16.020]梦里梦到醒不来的梦,\n[00:18.620]红线里被软禁的红,\n[00:23.320]所有刺激剩下疲乏的痛,\n[00:26.520]再无动于衷,\n[00:29.820]从背后抱你的时候,\n[00:33.720]期待的却是她的面容,\n[00:37.450]说来实在嘲讽我不太懂,\n[00:41.050]偏渴望你懂,\n[00:44.450]是否幸福轻得太沉重,\n[00:48.200]过度使用不痒不痛,\n[00:52.010]烂熟透红空洞了的瞳孔,\n[00:56.260]终于掏空终于有始无终,\n[00:59.510]得不到的永远在骚动,\n[01:03.109]被偏爱的都有恃无恐,\n[01:06.810]玫瑰的红容易受伤的梦,\n[01:11.159]握在手中却流失于指缝,\n[01:14.659]又落空,\n[01:30.720]红是朱砂痣烙印心口,\n[01:33.519]红是蚊子血般平庸,\n[01:38.430]时间美化那仅有的悸动,\n[01:41.519]也磨平激动,\n[01:44.819]从背后抱你的时候,\n[01:48.680]期待的却是她的面容,\n[01:52.519]说来实在嘲讽,\n[01:54.849]我不太懂偏渴望你懂,\n[01:59.550]是否幸福轻得太沉重,\n[02:03.299]过度使用不痒不痛,\n[02:06.799]烂熟透红空洞了的瞳孔,\n[02:11.150]终于掏空终于有始无终,\n[02:14.400]得不到的永远在骚动,\n[02:18.199]被偏爱的都有恃无恐,\n[02:22.050]玫瑰的红容易受伤的梦,\n[02:26.050]握在手中却流失于指缝,\n[02:29.449]又落空,\n[02:44.690]是否说爱都太过沉重,\n[02:48.240]过度使用不痒不痛,\n[02:51.940]烧得火红蛇行缠绕心中,\n[02:56.039]终于冷冻终于有始无终,\n[02:59.440]得不到的永远在骚动,\n[03:03.189]被偏爱的都有恃无恐,\n[03:06.939]玫瑰的红容易受伤的梦,\n[03:11.090]握在手中却流失于指缝,\n[03:14.539]得不到的永远在骚动,\n[03:18.189]被偏爱的都有恃无恐,\n[03:22.039]玫瑰的红伤口绽放的梦,\n[03:26.139]握在手中却流失于指缝,\n[03:29.490]再落空,\n', '陈奕迅', '<认了吧>');

-- --------------------------------------------------------

--
-- 表的结构 `songers`
--

CREATE TABLE `songers` (
  `id` int(10) NOT NULL,
  `name` varchar(20) NOT NULL,
  `introduce` varchar(500) NOT NULL,
  `pic` varchar(20) NOT NULL,
  `inalbum` varchar(200) NOT NULL,
  `inmusic` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 转存表中的数据 `songers`
--

INSERT INTO `songers` (`id`, `name`, `introduce`, `pic`, `inalbum`, `inmusic`) VALUES
(8, '毛不易', '毛不易，中国内地流行乐男歌手，毕业于杭州师范大学护理专业。2017年，参加选秀娱乐节目《明日之子》的比赛，获得全国总决赛冠军，从而正式进入演艺圈；9月1日，推出首张个人音乐专辑《巨星不易工作室 No.1》；11月11日，推出个人原创单曲《项羽虞姬》。', '1715395423056.jpg', '<平凡的一天>', '消愁'),
(9, '薛之谦', '薛之谦（Joker Xue），中国内地流行乐男歌手、影视演员、音乐制作人。 2005年，因参加选秀节目《我型我秀》而正式出道。2006年，发行首张同名专辑《薛之谦》，随后凭借歌曲《认真的雪》获得广泛关注。2007年，凭借专辑《你过得好吗》获得MusicRadio中国TOP排行榜内地年度最受欢迎男歌手奖。2008年，发行专辑《深深爱过你》，同年在上海举行个人首场演唱会“谦年传说”。2013年，专辑《几个薛之谦》获得MusicRadio中国TOP排行榜内地推荐唱片。2014年，凭借专辑《意外》获得第21届东方风云榜颁奖最佳唱作人；同年他还获得音悦V榜年度盛典年度创作歌手奖。 2015年6月，薛之谦首度担当制作人并发行原创EP《绅士》。', '1715395683241.jpg', '<绅士>', '演员'),
(10, '林俊杰', 'JJ林俊杰的创作来自最深的情感，他的声音唱出灵魂的璀璨，他把音乐和梦想当做能量，一路走到无人取代的地位，他写下华语乐坛最动人的经典乐章，撼动亚洲数十亿颗心跳。他是亚洲乐坛全能唱作天王 JJ 林俊杰。 2003年首发第一张个人创作专辑《乐行者》，取得不俗成绩；其杰出的创作才能又在之后2004年的凭借歌曲【江南】而成名，并于同年获得第15届金曲奖之「最佳演唱新人奖」。随后的【小酒窝】、【曹操】、【她说】等歌曲亦造成广大回响。2011年8月8日携手华纳，迈出世界。 2020至2021年【幸存者·如你】双维度EP，创造全新音乐视角。由JJ 林俊杰亲自领导整张专辑的企划创意与视觉，新专辑一推出便占据大中华区各大排行榜，销售量更在一个月内突破百万。 把音乐和梦想当做能量，一路走到无人取代的地位，写下华语乐坛最动人的经典乐章，他是亚洲全能唱作天王JJ林俊杰。', '1715435225109.jpg', '因你而在,<第二天堂>', '背对背拥抱,江南'),
(11, '陈奕迅', '陈奕迅（Eason Chan），中国香港流行乐男歌手、演员、作曲人，毕业于英国金斯顿大学。 1995年参加第14届新秀歌唱大赛并获得冠军，同年正式出道。1996年发行个人首张专辑《陈奕迅》。1997年主演个人首部电影《旺角大家姐》。1998年凭借歌曲《天下无双》在乐坛获得关注。2000年发行的歌曲《K歌之王》奠定其在歌坛的地位。2001年发行流行摇滚风格的专辑《反正是我》。2003年发行个人首张概念专辑《黑·白·灰》，专辑中的歌曲《十年》获得第4届音乐风云榜十大金曲奖；同年凭借专辑《Special Thanks to》获得第14届台湾金曲奖最佳国语男歌手以及最佳专辑奖。 2005年发行粤语专辑《U87》，专辑中的歌曲《浮夸》成为其歌唱生涯的代表作品之一。', '1715670935276.jpg', '<第二天堂>', '红玫瑰');

-- --------------------------------------------------------

--
-- 表的结构 `users`
--

CREATE TABLE `users` (
  `id` int(10) NOT NULL,
  `account` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `playlist` varchar(20) NOT NULL,
  `pic` varchar(500) NOT NULL,
  `status` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 转存表中的数据 `users`
--

INSERT INTO `users` (`id`, `account`, `password`, `name`, `phone`, `playlist`, `pic`, `status`) VALUES
(1, 'xiaohong', '123456', '半岛铁核武器', '13212341235', '3,4,5,7,8', '1715578403379.jpg', 0),
(2, 'ceshi', '123456', '侠客行', '13634566789', '', '1715673156360.jpg', 0),
(3, '测试1', '123456', '', '', '', '', 1),
(4, 'yjst', '123456', '小红毛小子', '12345678907', '', '1715672391147.jpg', 0),
(5, '小红帽', '123456', '小黄毛', '13834354546', '', '1715396470656.jpg', 0),
(6, 'xzzx', '123456', '测试2024', '13423453456', '', '1715577486601.jpg', 0),
(7, 'ceshi3', '123456', '小红帽2', '13425678976', '', '1715673247231.jpg', 0),
(8, 'ceshi4', '123456', '大灰狼', '13445343456', '', '1715673873176.jpg', 0),
(9, '测试4', '123456', '灰太狼', '13467895678', '', '1715703365957.jpg', 0),
(10, '测试5', '123456', '灰太狼1', '13456787890', '', '1715703923003.jpg', 0),
(11, '123', '123456', '喜羊羊', '13445677890', '', '1715750742053.jpg', 0);

--
-- 转储表的索引
--

--
-- 表的索引 `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `albums`
--
ALTER TABLE `albums`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `musics`
--
ALTER TABLE `musics`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `songers`
--
ALTER TABLE `songers`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `albums`
--
ALTER TABLE `albums`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- 使用表AUTO_INCREMENT `musics`
--
ALTER TABLE `musics`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- 使用表AUTO_INCREMENT `songers`
--
ALTER TABLE `songers`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- 使用表AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
